app/Controllers/Client/ChatController.php

    public function directory()
    {
        $userId = session()->get('id') ?? session()->get('user_id');
        if (!$userId) return redirect()->to('/login');

        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($userId);
        $companyId = $user['client_id'];
        $companyUsers = $companyId ? $userModel->where('client_id', $companyId)->findColumn('id') : [$userId];

        // Fetch all tickets/chats for this client, ordered by latest update
        $chats = $this->ticketModel
            ->select('tickets.*, COALESCE(t.full_name, s.email) as staff_name')
            ->join('users s', 's.id = tickets.assigned_to', 'left')
            ->join('tsrs t', 't.user_id = s.id', 'left')
            ->whereIn('tickets.client_id', $companyUsers)
            ->orderBy('updated_at', 'DESC')
            ->findAll();
---
SELECT `tickets`.*, COALESCE(t.full_name, s.email) as staff_name
FROM `tickets`
LEFT JOIN `users` `s` ON `s`.`id` = `tickets`.`assigned_to`
LEFT JOIN `tsrs` `t` ON `t`.`user_id` = `s`.`id`
WHERE `client_id` = '2'
ORDER BY `updated_at` DESC