app/Controllers/Client/Dashboard.php

SELECT *
FROM `clients`
WHERE `user_id` = '2'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `client_id` = '2'
AND `created_at` >= '2026-02-28 00:00:00'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `client_id` = '2'
AND `created_at` >= '2026-02-20 00:00:00'
AND `created_at` <= '2026-02-27 23:59:59'
---
    public function index()
    {
        // Safety check: ensure only clients can access this logic
        if ($this->session->get('role') !== 'client') {
            return redirect()->to(base_url('login'))->with('msg', 'Unauthorized access.');
        }

        $clientModel = new ClientModel();
        $ticketModel = new \App\Models\TicketModel();
        $clientId = $this->session->get('id');

        // Fetch specific company profile data using the session user_id
        $clientProfile = $clientModel->where('user_id', $this->session->get('id'))->first();

        // Populate viewData with role-specific information
        $this->viewData['title'] = 'Client Portal';
        $this->viewData['page_title'] = 'Welcome, ' . ($clientProfile['company_name'] ?? 'Client');
        $this->viewData['company_name'] = $clientProfile['company_name'] ?? 'Company Profile Not Found';
        $this->viewData['hr_contact'] = $clientProfile['hr_contact'] ?? 'N/A';
        $this->viewData['active_chats'] = 0; // Placeholder for chat app development

        // Fetch Statistics using the new Analytics engine
        $analyticsModel = new \App\Models\AnalyticsModel();
        $analyticsData = $analyticsModel->getAnalyticsStats($clientId);
        foreach ($analyticsData as $key => $val) { $this->viewData[$key] = $val; }

        // Fetch Chat/Ticket Metrics (Today vs Last 7 Days Avg)
        $chatsToday = $ticketModel->where('client_id', $clientId)->where('created_at >=', date('Y-m-d') . ' 00:00:00')->countAllResults();
        $chatsLast7Avg = $ticketModel->where('client_id', $clientId)
                                     ->where('created_at >=', date('Y-m-d', strtotime('-8 days')) . ' 00:00:00')
                                     ->where('created_at <=', date('Y-m-d', strtotime('-1 days')) . ' 23:59:59')
                                     ->countAllResults() / 7;

SELECT COUNT(*) AS `numrows`
FROM `kb_feedback`
WHERE `user_id` = '2'
SELECT COUNT(*) AS `numrows`
FROM `kb_feedback`
WHERE `user_id` = '2'
AND `is_helpful` = 1
---

        // Fetch Reporting (Sentiment) from KB Feedback
        $db = \Config\Database::connect();
        $feedbackTotal = $db->table('kb_feedback')->where('user_id', $clientId)->countAllResults();
        $feedbackHelpful = $db->table('kb_feedback')->where('user_id', $clientId)->where('is_helpful', 1)->countAllResults();

SELECT *
FROM `tickets`
WHERE `client_id` = '2'
ORDER BY `updated_at` DESC
 LIMIT 5
---
        $this->viewData['feedback_total'] = $feedbackTotal;

        // Fetch recent tickets
        $this->viewData['recent_tickets'] = $ticketModel->where('client_id', $clientId)
                                                        ->orderBy('updated_at', 'DESC')
                                                        ->limit(5)
                                                        ->findAll();