app/Controllers/Admin/ClientController.php

    public function index()
    {
        if ($this->session->get('role') !== 'superadmin') {
            return redirect()->to(base_url('login'))->with('msg', 'Unauthorized access.');
        }

        $db = \Config\Database::connect();

        $builder = $db->table('users');
        $builder->select('users.id, users.email, users.status, clients.company_name, clients.hr_contact');
        $builder->join('clients', 'clients.user_id = users.id');
        $builder->where('users.role', 'client');
        $query = $builder->get();

        $this->viewData['title'] = 'Client Management';
        $this->viewData['page_title'] = 'Corporate Accounts';
        $this->viewData['client_list'] = $query->getResultArray();

        // Fetch all TSRs for the dropdown
        $tsrQuery = $db->table('users')
                       ->select('id, email')
                       ->where('role', 'tsr')
                       ->where('status', 'active')
                       ->get();
---
SELECT `id`, `email`
FROM `users`
WHERE `role` = 'tsr'
AND `status` = 'active'