app/Controllers/BaseController.php

    protected function recordAnalytics()
    {
        $db = \Config\Database::connect();
        $userId = $this->session->get('id');
        $sessionId = session_id();
        $ip = $this->request->getIPAddress();
        $today = date('Y-m-d');

        // 1. Always track as Page View
        $db->table('analytics')->insert([
            'client_id'  => $userId,
            'type'       => 'page_view',
            'ip_address' => $ip,
            'session_id' => $sessionId,
            'created_at' => date('Y-m-d H:i:s')
        ]);
---
INSERT INTO `analytics` (`client_id`, `type`, `ip_address`, `session_id`, `created_at`) VALUES ('2', 'page_view', '::1', '7dc2c49bd38187b708b0f6b5e9f4b5a0', '2026-02-28 02:16:56')