app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // 1. Initialize Session globally
        $this->session = \Config\Services::session();

        // 2. Pre-populate shared view data for consistency (Header/Sidebar)
        $role = $this->session->get('role');
        $staffRoles = ['admin', 'superadmin', 'tsr_level_1', 'tl', 'supervisor', 'manager', 'dev', 'tsr_level_2', 'it', 'tsr'];
        $portalPrefix = in_array($role, $staffRoles) ? (in_array($role, ['admin', 'superadmin']) ? 'superadmin' : 'tsr') : $role;

        $userId = $this->session->get('id');
        $userAvailability = 'offline';
        if ($userId) {
            $db = \Config\Database::connect();
            $userRecord = $db->table('users')->select('availability_status')->where('id', $userId)->get()->getRowArray();
---
SELECT `availability_status`
FROM `users`
WHERE `id` = '14'

    protected function recordAnalytics()
    {
        $db = \Config\Database::connect();
        $userId = $this->session->get('id');
        $sessionId = session_id();
        $ip = $this->request->getIPAddress();
        $today = date('Y-m-d');

        // 1. Always track as Page View
        $db->table('analytics')->insert([
            'client_id'  => $userId,
            'type'       => 'page_view',
            'ip_address' => $ip,
            'session_id' => $sessionId,
            'created_at' => date('Y-m-d H:i:s')
        ]);

        // 2. Track as Visitor if first time for this session today
        $exists = $db->table('analytics')
                    ->where('client_id', $userId)
                    ->where('session_id', $sessionId)
                    ->where('type', 'visitor')
                    ->where('created_at >=', $today . ' 00:00:00')
                    ->countAllResults();
---
INSERT INTO `analytics` (`client_id`, `type`, `ip_address`, `session_id`, `created_at`) VALUES ('14', 'page_view', '::1', '9abe544e4c602136fa785cc65d4e5868', '2026-03-07 11:27:35')
SELECT COUNT(*) AS `numrows`
FROM `analytics`
WHERE `client_id` = '14'
AND `session_id` = '9abe544e4c602136fa785cc65d4e5868'
AND `type` = 'visitor'
AND `created_at` >= '2026-03-07 00:00:00'