app/Controllers/NotificationController.php

    public function fetch()
    {
        $userId = session()->get('id') ?? session()->get('user_id');
        if (!$userId) {
            return $this->response->setJSON(['status' => 'error', 'msg' => 'Unauthorized']);
        }

        // Fetch up to 20 recent notifications
        $notifications = $this->notificationModel
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->limit(20)
            ->findAll();

        $unreadCount = $this->notificationModel
            ->where('user_id', $userId)
            ->where('is_read', 0)
            ->countAllResults();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '14'
ORDER BY `created_at` DESC
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '14'
AND `is_read` = 0