app/Models/AnalyticsModel.php

SELECT COUNT(*) AS `numrows`
FROM `analytics`
WHERE `client_id` = '2'
AND `type` = 'visitor'
AND `created_at` >= '2026-02-28 00:00:00'
SELECT COUNT(*) AS `numrows`
FROM `analytics`
WHERE `client_id` = '2'
AND `type` = 'page_view'
AND `created_at` >= '2026-02-28 00:00:00'
SELECT COUNT(*) AS `numrows`
FROM `analytics`
WHERE `client_id` = '2'
AND `type` = 'visitor'
AND `created_at` >= '2026-02-20 00:00:00'
AND `created_at` <= '2026-02-27 23:59:59'
SELECT COUNT(*) AS `numrows`
FROM `analytics`
WHERE `client_id` = '2'
AND `type` = 'page_view'
AND `created_at` >= '2026-02-20 00:00:00'
AND `created_at` <= '2026-02-27 23:59:59'
---
    public function getAnalyticsStats($clientIds)
    {
        $today = date('Y-m-d');
        $sevenDaysAgo = date('Y-m-d', strtotime('-7 days'));

        $clientIdsArray = (array) $clientIds;

        // 1. Visitors Today (Unique Session IDs)
        $visitorsToday = $this->whereIn('client_id', $clientIdsArray)
                             ->where('type', 'visitor')
                             ->where('created_at >=', $today . ' 00:00:00')
                             ->countAllResults();

        // 2. Page Views Today
        $viewsToday = $this->whereIn('client_id', $clientIdsArray)
                           ->where('type', 'page_view')
                           ->where('created_at >=', $today . ' 00:00:00')
                           ->countAllResults();

        // 3. Last 7 Days Avg (excluding today to show trend)
        $last7DaysStart = date('Y-m-d', strtotime('-8 days'));
        $last7DaysEnd = date('Y-m-d', strtotime('-1 days'));

        $visitorsLast7 = $this->whereIn('client_id', $clientIdsArray)
                              ->where('type', 'visitor')
                              ->where('created_at >=', $last7DaysStart . ' 00:00:00')
                              ->where('created_at <=', $last7DaysEnd . ' 23:59:59')
                              ->countAllResults() / 7;

        $viewsLast7 = $this->whereIn('client_id', $clientIdsArray)
                            ->where('type', 'page_view')
                            ->where('created_at >=', $last7DaysStart . ' 00:00:00')
                            ->where('created_at <=', $last7DaysEnd . ' 23:59:59')
                            ->countAllResults() / 7;