app/Models/TicketModel.php

SELECT `tickets`.*, COALESCE(c.company_name, u.email) as client_name, `u`.`full_name` as `creator_name`, COALESCE(t.full_name, s.email) as staff_name
FROM `tickets`
LEFT JOIN `users` `u` ON `u`.`id` = `tickets`.`client_id`
LEFT JOIN `clients` `c` ON `c`.`id` = `u`.`client_id`
LEFT JOIN `users` `s` ON `s`.`id` = `tickets`.`assigned_to`
LEFT JOIN `tsrs` `t` ON `t`.`user_id` = `s`.`id`
WHERE `tickets`.`status` IN ('Open','In Progress')
ORDER BY `tickets`.`created_at` DESC
---
    public function getTicketsInQueue(array $statuses = ['Open', 'In Progress'], $assignedToId = null): array
    {
        // We use COALESCE to fallback to the email if the company name isn't set.
        $builder = $this->select('tickets.*, COALESCE(c.company_name, u.email) as client_name, u.full_name as creator_name, COALESCE(t.full_name, s.email) as staff_name')
                    ->join('users u', 'u.id = tickets.client_id', 'left')
                    ->join('clients c', 'c.id = u.client_id', 'left')
                    ->join('users s', 's.id = tickets.assigned_to', 'left')
                    ->join('tsrs t', 't.user_id = s.id', 'left')
                    ->whereIn('tickets.status', $statuses);

        if ($assignedToId !== null) {
            $builder->where('tickets.assigned_to', $assignedToId);
        }

        return $builder->orderBy('tickets.created_at', 'DESC')->findAll();